<template>
  <TheMenu />
  <div class="content">
    <h1>О приложении</h1>
    <p class="content__p">
      О приложении. О приложении. О приложении. О приложении. О приложении. О
      приложении. О приложении. О приложении. О приложении. О приложении. О
      приложении. О приложении. О приложении. О приложении. О приложении. О
      приложении. О приложении. О приложении. О приложении. О приложении. О
      приложении. О приложении. О приложении. О приложении. О приложении. О
      приложении. О приложении. О приложении. О приложении. О приложении. О
      приложении. О приложении. О приложении. О приложении. О приложении. О
      приложении. О приложении. О приложении. О приложении. О приложении. О
      приложении. О приложении. О приложении. О приложении.
    </p>
  </div>
</template>

<script>
// @ is an alias to /src
import TheMenu from "@/components/TheMenu.vue";

export default {
  name: "AboutView",
  components: {
    TheMenu,
  },
};
</script>
