<template>
  <TheMenu />
  <div id="content">
    <h1>Создание новой записи</h1>
    <p id="content_text">
      Основной контент страницы создания новой записи. Основной контент страницы
      создания новой записи. Основной контент страницы создания новой записи.
      Основной контент страницы создания новой записи. Основной контент страницы
      создания новой записи. Основной контент страницы создания новой записи.
      Основной контент страницы создания новой записи. Основной контент страницы
      создания новой записи. Основной контент страницы создания новой записи.
      Основной контент страницы создания новой записи.
    </p>
  </div>
</template>

<script>
// @ is an alias to /src
import TheMenu from "@/components/TheMenu.vue";

export default {
  name: "EditView",
  components: {
    TheMenu,
  },
};
</script>
