<template>
  <TheMenu />
  <div class="content content__p">
    <h1>Техническое задание</h1>

    <p>Средствами Vue.js реализуйте небольшое SPA приложение для заметок.</p>
    <p>
      Каждая заметка имеет название и список задач (todo list), далее - Todo.
      Каждый пункт Todo состоит из чекбокса и относящейся к нему текстовой
      подписи.
    </p>
    <p>Приложение состоит всего из 2х страниц.</p>
    <p>
      На главной странице отображается список всех заметок. Для каждой заметки
      отображается заголовок и Todo, сокращенный до нескольких пунктов, без
      возможности отмечать.
    </p>

    <h3>Действия на главной:</h3>

    <ul>
      <li><p>перейти к созданию новой заметки</p></li>
      <li><p>перейти к изменению</p></li>
      <li><p>удалить (необходимо подтверждение)</p></li>
    </ul>
    <p>
      Страница изменения заметки позволяет определенную заметку отредактировать,
      отметить пункты Todo, а после сохранить изменения.
    </p>
    <h3>Действия с заметкой:</h3>

    <ul>
      <li><p>сохранить изменения</p></li>
      <li><p>отменить редактирование (необходимо подтверждение)</p></li>
      <li><p>удалить (необходимо подтверждение)</p></li>
      <li><p>отменить внесенное изменение</p></li>
      <li><p>повторить отмененное изменение</p></li>
    </ul>
    <h3>Действия с пунктами Todo:</h3>
    <ul>
      <li><p>добавить</p></li>
      <li><p>удалить</p></li>
      <li><p>отредактировать текст</p></li>
      <li><p>отметить как выполненный</p></li>
    </ul>
    <h3>Требования к функционалу:</h3>
    <ul>
      <li>
        <p>
          Все действия на сайте должны происходить без перезагрузки страницы.
        </p>
      </li>
      <li>
        <p>
          Подтверждение действий (удалить заметку) выполняется с помощью
          диалогового окна.
        </p>
      </li>
      <li><p>Интерфейс должен отвечать требованиям usability.</p></li>
      <li>
        <p>
          После перезагрузки страницы состояние списка заметок должно
          сохраняться.
        </p>
      </li>
      <li>
        <p>
          Можно пренебречь несоответствием редактирования текста с помощью
          кнопок отменить/повторить и аналогичным действиям с помощью
          комбинацияй клавиш (Ctrl+Z, Command+Z, etc.).
        </p>
      </li>
    </ul>
    <h3>Технические требования:</h3>
    <ul>
      <li>
        <p>
          Диалоговые окна должны быть реализованы без использования "alert",
          "prompt" и "confirm".
        </p>
      </li>
      <li>
        <p>
          В качестве языка разработки допускается использовать JavaScript или
          TypeScript.
        </p>
      </li>
      <li>
        <p>В качестве сборщика, если это необходимо, используйте Webpack.</p>
      </li>
      <li>
        <p>
          Верстка должна быть выполнена без использования UI библиотек (например
          Vuetify).
        </p>
      </li>
      <li><p>Адаптивность не обязательна, но приветствуется.</p></li>
      <li>
        <p>
          Логика приложения должна быть разбита на разумное количество
          самодостаточных Vue-компонентов.
        </p>
      </li>
    </ul>
    <h3>Особое внимание стоит обратить на следующие моменты:</h3>
    <ul>
      <li>
        <p>
          Код должен быть написан понятно и аккуратно, с соблюдением табуляции и
          прочих элементов написания, без лишних элементов и функций, не имеющих
          отношения к функционалу тестового задания, снабжен понятными
          комментариями.
        </p>
      </li>
      <li><p>Читабельность и наличие элементарной архитектуры.</p></li>
      <li>
        <p>
          Чистота и оформление кода — не менее важный фактор. Код должен быть
          написан в едином стиле (желательно в рекомендуемом для конкретного
          языка). Также к чистоте относятся отсутствие копипаста и дублирования
          логики.
        </p>
      </li>
    </ul>
    <h3>Тестовое задание должно быть предоставлено в следующем виде:</h3>
    <ul>
      <li>
        <p>
          Ссылка на публичный репозиторий (GitHub, BitBucket, GitLab) с исходным
          кодом.
        </p>
      </li>
      <li>
        <p>
          Ссылка на сайт для тестирования функционала. Или Dockerfile и
          docker-compose.yaml, позволяющие развернуть локально командой
          docker-compose up работоспособную копию сайта.
        </p>
      </li>
    </ul>
  </div>
</template>

<script>
// @ is an alias to /src
import TheMenu from "@/components/TheMenu.vue";

export default {
  name: "TechView",
  components: {
    TheMenu,
  },
};
</script>
