<template>
  <TheMenu />
  <div id="content">
    <h1>Техническое задание</h1>
    <p id="content_text">
      Текст технического задания. Текст технического задания. Текст технического
      задания. Текст технического задания. Текст технического задания. Текст
      технического задания. Текст технического задания. Текст технического
      задания. Текст технического задания. Текст технического задания. Текст
      технического задания. Текст технического задания. Текст технического
      задания. Текст технического задания. Текст технического задания.
    </p>
  </div>
</template>

<script>
// @ is an alias to /src
import TheMenu from "@/components/TheMenu.vue";

export default {
  name: "TechView",
  components: {
    TheMenu,
  },
};
</script>
